Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresFiles.GetFileDictionaryByExtension Method
 Retrieves a dictionary of file names and their corresponding paths from multiple directories.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Dictionary<string, string> GetFileDictionaryByExtension(
	string fileExtension,
	string modelPath
)
Public Shared Function GetFileDictionaryByExtension (
	fileExtension As String,
	modelPath As String
) As Dictionary(Of String, String)
Parameters
fileExtension
Type: System.String
The file extension to filter the files by.
modelPath
Type: System.String
The model path.
Return Value
Type: Dictionary<String, String>
A dictionary containing file names without the extension and their paths.
See Also
Reference
TeklaStructuresFiles Class
Tekla.Structures Namespace